Repository: jhamby/flutter-games
Catalog: blackjack_game/lib/l10n/app_*.arb
Languages: es, fr

# gameTitle
source: Blackjack Trainer
es: Entrenadora de blackjack
fr: Entraîneur de Blackjack

# dealSpeed
source: Deal {speed} cards per second
es: Repartir $speed de velocidad por segundo
fr: Distribuez $speed cards par seconde

# gameRulesLabel
source: Rules of Blackjack
es: Reglas del Blackjack
fr: Règles du Blackjack

# gameRulesText
source: The goal of Blackjack is to play a hand with a higher value than the dealer's hand, without going over 21. The players and dealer each receive two cards to start, with only one of the dealer's cards visible. All cards count at their face value, with Jack, Queen, and King counting as 10, and Ace counting as either 1 or 11. A hand with an Ace and a 10-value card is called Blackjack and pays 3 to 2. The player wins the value of their bet if their hand has a higher value than the dealer, loses the bet if their hand has a lower value, and keeps the original bet if they're the same, called a "push". If the dealer's visible card is an Ace, you can buy insurance against the dealer having Blackjack. This is a side bet of up to half of your current bet, and pays 2 to 1 if the dealer has Blackjack. For each deal, you can "hit" to add another card, "stand" if you're satisfied with your hand, or "double down" to increase your bet by up to 100% in return for receiving exactly one more card. If your first two cards have the same value, you can "split" them into two hands, which doubles your bet. A second card is dealt for each of the two hands, and you can play each one separately. The dealer always hits until their hand is 17 or higher. The dealer will also hit on "soft 17" (a hand containing an Ace and cards adding up to 6, for a total of 17 or 7), but this rule can be changed in Settings.
es: El objetivo del Blackjack es jugar una mano con un valor más alto que la mano del crupier, sin pasar de 21. Los jugadores y el crupier reciben cada uno dos cartas para comenzar, con solo una de las cartas del crupier visible. Todas las cartas cuentan por su valor nominal, con Jota, Reina y Rey contando como 10, y As contando como 1 u 11. Una mano con un As y una carta de valor 10 se llama Blackjack y paga 3 a 2. El jugador gana el valor de su apuesta si su mano tiene un valor más alto que el del crupier, pierde la apuesta si su mano tiene un valor más bajo y mantiene la apuesta original si son iguales. Si la carta visible del crupier es un As, puede comprar un seguro para que el crupier no tenga Blackjack. Esta es una apuesta adicional de hasta la mitad de su apuesta actual y paga 2 a 1 si el crupier tiene Blackjack. Para cada trato, puede "pedir" para agregar otra carta, "plantarse" si está satisfecho con su mano o "doblar" para aumentar su apuesta hasta en un 100% a cambio de recibir exactamente una carta más. Si sus dos primeras cartas tienen el mismo valor, puede "separarlas" en dos manos, lo que duplica su apuesta. Se reparte una segunda carta para cada una de las dos manos, y puede jugar cada una por separado. El crupier siempre pide hasta que su mano sea 17 o más. El crupier también solicitará un "17 suave" (una mano que contiene un As y cartas que suman 6, para un total de 17 o 7), pero esta regla se puede cambiar en Configuración.
fr: Le but du Blackjack est de jouer une main avec une valeur supérieure à la main du croupier, sans dépasser 21. Les joueurs et le croupier reçoivent chacun deux cartes pour commencer, avec une seule des cartes du croupier visible. Toutes les cartes comptent à leur valeur nominale, avec Jack, Queen et King comptant pour 10, et As comptant pour 1 ou 11. Une main avec un As et une carte de valeur 10 est appelée Blackjack et paie 3 contre 2. Le joueur gagne la valeur de sa mise si sa main a une valeur supérieure à celle du croupier, perd la mise si sa main a une valeur inférieure et conserve la mise initiale si elle est la même. Si la carte visible du croupier est un As, vous pouvez souscrire une assurance contre le croupier ayant un Blackjack. Il s'agit d'un pari parallèle jusqu'à la moitié de votre mise actuelle, et paie 2 contre 1 si le croupier a un Blackjack. Pour chaque accord, vous pouvez dire «Carte!» pour ajouter une autre carte, «je reste» si vous êtes satisfait de votre main ou «doubler» pour augmenter votre mise jusqu'à 100% en échange de recevoir exactement une carte supplémentaire. Si vos deux premières cartes ont la même valeur, vous pouvez les «séparer» en deux mains, ce qui double votre mise. Une deuxième carte est distribuée pour chacune des deux mains, et vous pouvez jouer chacune séparément. Le croupier frappe toujours jusqu'à ce que sa main soit supérieure ou égale à 17. Le croupier frappera également sur «17 soft» (une main contenant un as et des cartes totalisant jusqu'à 6, pour un total de 17 ou 7), mais cette règle peut être modifiée dans les paramètres.

# gameWelcome
source: Welcome to Blackjack!
es: ¡Bienvenido al Blackjack!
fr: Bienvenue au Blackjack!

# numberOfDecks
source: Number of decks: {decks}
es: Número de mazos: $mazos
fr: Nombre de paquets: $decks

# playGameLabel
source: Play Game
es: Jugar un juego
fr: Jouer au jeu

# playerBalance
source: Player Balance: ${balance}
es: Saldo del jugador: \ $$balance
fr: Solde du joueur: \ $$balance

# settingsLabel
source: Settings
es: Ajustes
fr: Réglages

# shufflePercent
source: Shuffle the deck at {percent}%
es: Baraja la baraja al $percent%
fr: Mélangez le jeu à $percent%

source: Dealer hits soft 17
es: El crupier golpea suave 17
fr: Le croupier frappe doucement 17

# dealerStandsSoft17
source: Dealer stands on soft 17
es: El crupier se para en 17 suave
fr: Le croupier se dresse sur soft 17

# settingNumDecksLabel
source: Number of decks
es: Numero de mazos
fr: Nombre de paquets

# settingShufflePercent
source: Shuffle the deck at
es: Baraja la baraja al
fr: Mélangez le jeu à

# settingResetBalance
source: Reset balance
es: Restablecer saldo
fr: Réinitialiser le solde

# playButtonHit
source: Hit
es: Pedir
fr: Carte

# playButtonStand
source: Stand
es: Plantarse
fr: Rester

# playButtonDouble
source: Double Down
es: Doblar
fr: Doubler

# playButtonSplit
source: Split
es: Separarlas
fr: Séparer
